# RoofArea_Total

## Description
Returns the total area along the slope of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_Total(c : CRITERIA): REAL;
```

```python
def vs.RoofArea_Total(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|   |

## Remarks
[[User:CBM-c-|_c_]] (2016.06.28): See remark on [[VS:RoofArea Heated]].

## See Also
* RoofArea Heated
* RoofArea HeatedProj
* RoofArea TotalProj

## Version
Availability: from Vectorworks 14.0

## Category
* Criteria